Repository: naoTimesdev/ndiscord.py
Catalog: docs/locale/*/LC_MESSAGES/ext/commands/cogs.po
Languages: id_id

source: There comes a point in your bot's development when you want to organize a collection of commands, listeners, and some state into one class. Cogs allow you to do just that.
id_id: Ada di mana ketika anda membuat bot dan anda ingin mengorganisir koleksi perintah, listener, dan sebuah status dalam satu kelas. Cogs dapat membantu anda melakukan hal itu.

source: The gist:
id_id: Singkatnya:

source: Each cog is a Python class that subclasses :class:`.commands.Cog`.
id_id: Setiap cog merupakan kelas Python yang merupakan turunan dari kelas :class:`.commands.Cog`.

source: Every command is marked with the :func:`.commands.command` decorator.
id_id: Setiap perintah ditandakan dengan dekorator :func:`.commands.command`.

source: Every listener is marked with the :meth:`.commands.Cog.listener` decorator.
id_id: Setiap listener ditandakan dengan dekorator :meth:`.commands.Cog.listener`.

source: Cogs are then registered with the :meth:`.Bot.add_cog` call.
id_id: Cogs dapat diregistrasi dengan memanggil fungsi :meth:`.Bot.add_cog`.

source: Cogs are subsequently removed with the :meth:`.Bot.remove_cog` call.
id_id: Cogs juga dapat dihapus dengan memanggil fungsi :meth:`.Bot.remove_cog`.

source: It should be noted that cogs are typically used alongside with :ref:`ext_commands_extensions`.
id_id: Harus dicatat bahwa cogs biasanya digunakan bersamaan dengan :ref:`ext_commands_extensions`.

source: Quick Example
id_id: Contoh

source: This example cog defines a ``Greetings`` category for your commands, with a single :ref:`command <ext_commands_commands>` named ``hello`` as well as a listener to listen to an :ref:`Event <discord-api-events>`.
id_id: Contoh ini akan mendefinisasikan kategori ``Greetings`` untuk perintah anda, dengan :ref:`perintah <ext_commands_commands>` bernama ``hello`` dan juga listener untuk memantau :ref:`Event <discord-api-events>`.

source: A couple of technical notes to take into consideration:
id_id: Beberapa catatan teknis untuk dipertimbangkan:

source: All listeners must be explicitly marked via decorator, :meth:`~.commands.Cog.listener`.
id_id: Semua listener harus ditandakan dengan dekorator, :meth:`~.commands.Cog.listener`.

source: The name of the cog is automatically derived from the class name but can be overridden. See :ref:`ext_commands_cogs_meta_options`.
id_id: Nama cog akan otomatis diambil dari nama kelas tetapi dapat diubah secara manual. Lihat :ref:`ext_commands_cogs_meta_options`.

source: All commands must now take a ``self`` parameter to allow usage of instance attributes that can be used to maintain state.
id_id: Semua perintah harus mengawali semua parameter dengan ``self`` untuk dapat menggunakan semua attribut yang dipakai untuk mengatur status.

source: Cog Registration
id_id: Pendaftaran Cog

source: Once you have defined your cogs, you need to tell the bot to register the cogs to be used. We do this via the :meth:`~.commands.Bot.add_cog` method.
id_id: Ketika anda mendifinisasikan cog, anda juga harus memberitau bot untuk mendaftarkan cog tersebut agar bisa digunakan. Kita bisa lakukan dengan fungsi :meth:`~.commands.Bot.add_cog`.

source: This binds the cog to the bot, adding all commands and listeners to the bot automatically.
id_id: Ini akan mengaitkan cog dengan bot, menambah semua perintah dan listener secara otomatis.

source: Note that we reference the cog by name, which we can override through :ref:`ext_commands_cogs_meta_options`. So if we ever want to remove the cog eventually, we would have to do the following.
id_id: Perlu diketahui modul ini menggunakan nama cog sebagai referensi, dan kita juga bisa mengubahnya melalui :ref:`ext_commands_cogs_meta_options`. Jadi jika kita ingin menghapus cog, kita harus melakukan hal berikut.

source: Using Cogs
id_id: Memakai Cogs

source: Just as we remove a cog by its name, we can also retrieve it by its name as well. This allows us to use a cog as an inter-command communication protocol to share data. For example:
id_id: Kita juga bisa mengambil cog dengan namanya, seperti kita menghapus dengan namanya. Ini membolehkan kita untuk berkomunikasi antar perintah untuk menyebar data. Contoh:

source: Special Methods
id_id: Metode Spesial

source: As cogs get more complicated and have more commands, there comes a point where we want to customise the behaviour of the entire cog or bot.
id_id: Ketika cog mulai jadi rumit dan lebih banyak perintah, ada kalanya kita ingin mengkustomisasi bagaimana bot atau cog akan bekerja.

source: They are as follows:
id_id: Anda dapat mengubah fungsi berikut:

source: You can visit the reference to get more detail.
id_id: Anda dapat mengunjungi referensi untuk info lebih lanjut.

source: Meta Options
id_id: Opsi Meta

source: At the heart of a cog resides a metaclass, :class:`.commands.CogMeta`, which can take various options to customise some of the behaviour. To do this, we pass keyword arguments to the class definition line. For example, to change the cog name we can pass the ``name`` keyword argument as follows:
id_id: Didalam cog, terdapat sebuah metadata untuk kelas Cog, yaitu :class:`.commands.CogMeta`, di mana kita dapat mengatur bagaiman cog akan bekerja. Untuk melakukannya, kita harus memberikan parameter ke bagian definisi kelas. Sebagai contoh, untuk mengatur nama cog kita dapat memberikan parameter ``name`` ke argument dengan cara berikut:

source: To see more options that you can set, see the documentation of :class:`.commands.CogMeta`.
id_id: Untuk melihat opsi yang dapat anda atur, silakan lihat dokumentasi :class:`.commands.CogMeta`.

source: Inspection
id_id: Inspeksi

source: Since cogs ultimately are classes, we have some tools to help us inspect certain properties of the cog.
id_id: Karena cogs merupakan tipe kelas, kita dapat menggunakan beberapa fungsi untuk memeriksa berbagai macam attribut pada cog.

source: To get a :class:`list` of commands, we can use :meth:`.Cog.get_commands`. ::
id_id: Untuk mendapatkan :class:`list` perintah, kita dapat menggunakan :meth:`.Cog.get_commands`. ::

source: If we want to get the subcommands as well, we can use the :meth:`.Cog.walk_commands` generator. ::
id_id: Jika kita ingin mendapatkan subperintah, kita bisa menggunakan generator :meth:`.Cog.walk_commands`. ::

source: To do the same with listeners, we can query them with :meth:`.Cog.get_listeners`. This returns a list of tuples -- the first element being the listener name and the second one being the actual function itself. ::
id_id: Untuk melakukan hal yang sama untuk listener, kita dapat mengambilnya dengan :meth:`.Cog.get_listeners`. Ini akan mengembalikan tuples -- dengan elemen pertama adalah nama listener dan yang kedua adalah fungsinya. ::
