Repository: naoTimesdev/ndiscord.py
Catalog: docs/locale/*/LC_MESSAGES/discord.po
Languages: id

source: Creating a Bot Account
id: Membuat akun Bot baru

source: In order to work with the library and the Discord API in general, we must first create a Discord Bot account.
id: Agar kita dapat menggunakan modul dan API Discord, pertama-tama kita harus membuat akun Bot Discord.

source: Creating a Bot account is a pretty straightforward process.
id: Membuat akun Bot sangatlah mudah.

source: Make sure you're logged on to the `Discord website <https://discord.com>`_.
id: Pastikan anda masuk ke `Website Discord <https://discord.com>`_.

source: Navigate to the `application page <https://discord.com/developers/applications>`_
id: Lalu pilih `application page <https://discord.com/developers/applications>`_

source: Click on the "New Application" button.
id: Klik tombol "New Application".

source: The new application button.
id: Tombol "New application".

source: Give the application a name and click "Create".
id: Berikan nama untuk aplikasi anda dan klik "Create".

source: The new application form filled in.
id: Form aplikasi baru yang sudah terisi.

source: Create a Bot User by navigating to the "Bot" tab and clicking "Add Bot".
id: Buat akun bot dengan menuju ke laman "Bot" dan mengeklik "Add Bot".

source: Click "Yes, do it!" to continue.
id: Klik "Yes, do it!" untuk melanjutkan.

source: The Add Bot button.
id: Tombol "Add Bot".

source: Make sure that **Public Bot** is ticked if you want others to invite your bot.
id: Pastikan boks **Public Bot** dicentang jika anda ingin orang lain menambah bot anda.

source: You should also make sure that **Require OAuth2 Code Grant** is unchecked unless you are developing a service that needs it. If you're unsure, then **leave it unchecked**.
id: Jika bisa, pastikan **Require OAuth2 Code Grant** tidak dicentang jika anda tidak membuat layanan yang membutuhkannya. Jika anda tidak yakin, **biarkan tidak dicentang**.

source: How the Bot User options should look like for most people.
id: Bagaimana opsi akun Bot terlihat untuk kebanyakan orang.

source: Copy the token using the "Copy" button.
id: Salin token bot dengan mengeklik tombol "Copy".

source: **This is not the Client Secret at the General Information page.**
id: **Ini bukanlah "Client Secret" pada laman "General Information".**

source: It should be worth noting that this token is essentially your bot's password. You should **never** share this with someone else. In doing so, someone can log in to your bot and do malicious things, such as leaving servers, ban all members inside a server, or pinging everyone maliciously.
id: Perlu dicatat bahwa token anda esensinya adalah password Bot anda. Pastikan anda **tidak** menyebarkannya kepada orang lain. Jika dilakukan, orang tersebut dapat mengakses Bot anda dan melakukan hal yang tidak-tidak, seperti keluar dari peladen, mem-ban semua pengguna didalam peladen, atau menggunakan @everyone.

source: The possibilities are endless, so **do not share this token.**
id: Banyak sekali kemungkinan yang tidak diinginkan, jadi **jangan sebarkan token anda!**

source: If you accidentally leaked your token, click the "Regenerate" button as soon as possible. This revokes your old token and re-generates a new one. Now you need to use the new token to login.
id: Jika anda tidak sengaja menyebarkan token anda, klik tombol "Regenerate" secepat mungkin. Ini akan menghapus token lama anda dan membuat token baru. Sekarang anda dapat menggunakan token baru untuk masuk ke akun Bot anda.

source: And that's it. You now have a bot account and you can login with that token.
id: Selesai. Anda sekarang dapat masuk ke akun Bot dengan token.

source: Inviting Your Bot
id: Menambah Bot Anda

source: So you've made a Bot User but it's not actually in any server.
id: Jadi anda sudah membuat akun Bot tapi bot-nya tidak ada di peladen manapun.

source: If you want to invite your bot you must create an invite URL for it.
id: Jika anda ingin menambah bot, anda harus membuat "Invite URL" terlebih dahulu.

source: Click on your bot's page.
id: Klik laman bot anda.

source: Go to the "OAuth2" tab.
id: Klik laman "OAuth2".

source: How the OAuth2 page should look like.
id: Bagaimana laman OAuth2 terlihat.

source: Tick the "bot" checkbox under "scopes".
id: Centang "bot" dibagian "scopes".

source: The scopes checkbox with "bot" ticked.
id: Boks "bot" pada bagian scopes harusnya tercentang.

source: Tick the permissions required for your bot to function under "Bot Permissions".
id: Centang semua permissions yang dibutuhkan agar bot anda dapat berfungsi di bagian "Bot Permissions".

source: Please be aware of the consequences of requiring your bot to have the "Administrator" permission.
id: Mohon hati-hati jika anda memberikan akses "Administrator" untuk bot anda.

source: Bot owners must have 2FA enabled for certain actions and permissions when added in servers that have Server-Wide 2FA enabled. Check the `2FA support page <https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_ for more information.
id: Pemilik Bot harus mengaktifkan 2FA untuk aksi dan hak tertentu ketika menambah bot ke peladen di mana dibutuhkan akses 2FA. Mohon kunjungi `laman bantuan 2FA <https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_ untuk info lebih lanjut.

source: The permission checkboxes with some permissions checked.
id: Pengaturan permission dengan beberapa hal yang dicentang.

source: Now the resulting URL can be used to add your bot to a server. Copy and paste the URL into your browser, choose a server to invite the bot to, and click "Authorize".
id: Harusnya anda mendapatkan URL di mana anda dapat menggunakannya untuk menambah Bot ke peladen anda. Salin dan timpa URL ke browser anda, pilih peladen, lalu klik "Authorize".

source: The person adding the bot needs "Manage Server" permissions to do so.
id: Orang yang menambahkan bot harus memiliki hak "Manage Server" di peladen tersebut.

source: If you want to generate this URL dynamically at run-time inside your bot and using the :class:`discord.Permissions` interface, you can use :func:`discord.utils.oauth_url`.
id: Jika anda ingin membuat URL ini secara dinamik saat bot sudah jalan dengan menggunakan :class:`discord.Permissions`, anda dapat menggunakan :func:`discord.utils.oauth_url`.
