Repository: naoTimesdev/ndiscord.py
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: id

source: Frequently Asked Questions
id: Pertanyaan Yang Sering Diajukan

source: This is a list of Frequently Asked Questions regarding using ``ndiscord.py`` and its extension modules. Feel free to suggest a new question or submit one via pull requests.
id: Di halaman ini anda dapat melihat berbagai macam pertanyaan seputar ``ndiscord.py`` dan semua ekstensinya. Jangan ragu untuk membuat saran baru atau membuat pull request.

source: Questions
id: Pertanyaan

source: Questions regarding coroutines and asyncio belong here.
id: Pertanyaan tentang coroutines dan asyncio akan dijelaskan di sini.

source: What is a coroutine?
id: Apa itu coroutine?

source: A |coroutine_link|_ is a function that must be invoked with ``await`` or ``yield from``. When Python encounters an ``await`` it stops the function's execution at that point and works on other things until it comes back to that point and finishes off its work. This allows for your program to be doing multiple things at the same time without using threads or complicated multiprocessing.
id: |coroutine_link|_ merupakan fungsi yang harus dipakai dengan kata ``await`` atau ``yield from``. Ketika Python menemukan ``await`` eksekusi fungsi tersebut akan dihentikan sementara dan melakukan hal lain dan kembali ke fungsi tersebut dan membereskan tugasnya. Ini memungkinkan program anda untuk melakukan berbagai hal secara bersamaan tanpa menggunakan ``threads`` atau ``multiprocessing``.

source: **If you forget to await a coroutine then the coroutine will not run. Never forget to await a coroutine.**
id: **Jika anda melupakan await, maka coroutine tidak akan jalan. Jangan lupakan await untuk coroutine.**

source: Where can I use ``await``\?
id: Di mana saya bisa menggunakan ``await``?

source: You can only use ``await`` inside ``async def`` functions and nowhere else.
id: Anda hanya dapat menggunakan ``await`` di dalam fungsi ``async def`` saja.

source: What does "blocking" mean?
id: Maksudnya "blocking" itu apa?

source: In asynchronous programming a blocking call is essentially all the parts of the function that are not ``await``. Do not despair however, because not all forms of blocking are bad! Using blocking calls is inevitable, but you must work to make sure that you don't excessively block functions. Remember, if you block for too long then your bot will freeze since it has not stopped the function's execution at that point to do other things.
id: Di asynchronous programming, panggilan blocking intinya adalah semua bagian fungsi yang tidak ``await``. Jangan hilang harapan dulu, soalnya tidak semua blocking itu buruk! Menggunakan blocking itu tidak dapat dihindari, tapi anda harus dapat membuat fungsi itu tidak terlalu ngeblokir fungsi lain. Ingat, jika anda ngeblock terlalu lama bot anda akan berhenti berfungsi dikarenakan belum selesai mengeksekusi fungsi yang anda gunakan dan tidak bisa melakukan hal lain.

source: If logging is enabled, this library will attempt to warn you that blocking is occurring with the message: ``Heartbeat blocked for more than N seconds.`` See :ref:`logging_setup` for details on enabling logging.
id: Jika logging diaktifkan, modul ini akan mengingatkan anda kalau sedang terjadi blocking dengan pesan: ``Heartbeat blocked for more than N seconds.`` Lihat :ref:`logging_setup` untuk info lebih lanjut.

source: A common source of blocking for too long is something like :func:`time.sleep`. Don't do that. Use :func:`asyncio.sleep` instead. Similar to this example: ::
id: Salah satu contoh blocking yang terlalu lama adalah :func:`time.sleep`. Jangan lakukan itu. Gunakan :func:`asyncio.sleep`. Kurang lebih seperti ini: ::

source: Another common source of blocking for too long is using HTTP requests with the famous module :doc:`req:index`. While :doc:`req:index` is an amazing module for non-asynchronous programming, it is not a good choice for :mod:`asyncio` because certain requests can block the event loop too long. Instead, use the :doc:`aiohttp <aio:index>` library which is installed on the side with this library.
id: Salah satu contoh blocking lain adalah HTTP requests yang terlalu lama dengan modul :doc:`req:index`. Walaupun modul :doc:`req:index` itu bagus untuk modul non-asynchronous, modul tersebut tidak cocok untuk :mod:`asyncio` karena beberapa request akan ngeblock event loop terlalu lama. Jadi, gunakan modul :doc:`aiohttp <aio:index>` yang harusnya terinstall bersama dengan modul ``ndiscord.py``.

source: Consider the following example: ::
id: Perhatikan contoh berikut: ::

source: General
id: Pertanyaan Umum

source: General questions regarding library usage belong here.
id: Pertanyaan umum tentang penggunaan modul akan dijelaskan di sini.

source: Where can I find usage examples?
id: Di mana saya bisa menemukan contoh penggunaan?

source: Example code can be found in the `examples folder <https://github.com/naoTimesdev/ndiscord.py/tree/master/examples>`_ in the repository.
id: Contoh dapat anda temukan di `folder examples <https://github.com/naoTimesdev/ndiscord.py/tree/master/examples>`_ di repository.

source: How do I set the "Playing" status?
id: Bagaimana saya mengatur status "Playing"?

source: The ``activity`` keyword argument may be passed in the :class:`Client` constructor or :meth:`Client.change_presence`, given an :class:`Activity` object.
id: Argumen ``activity`` dapat anda berikan ke :class:`Client` atau :meth:`Client.change_presence`, dengan memberikan obyek :class:`Activity`.

source: The constructor may be used for static activities, while :meth:`Client.change_presence` may be used to update the activity at runtime.
id: ``Client`` hanya dapat digunakan pas awal-awal, sementara :meth:`Client.change_presence` dapat digunakan saat bot sudah aktif.

source: It is highly discouraged to use :meth:`Client.change_presence` or API calls in :func:`on_ready` as this event may be called many times while running, not just once.
id: Tidak disarankan untuk menggunakan :meth:`Client.change_presence` atau memanggil API lain di :func:`on_ready` dikarenakan event ini dapat dipanggil berkali-kali saat bot aktif, bukan sekali saja.

source: There is a high chance of disconnecting if presences are changed right after connecting.
id: Ada kemungkinan tinggi bot anda akan terputus dari Discord jika presence diubah saat bot sedang menyala.

source: The status type (playing, listening, streaming, watching) can be set using the :class:`ActivityType` enum. For memory optimisation purposes, some activities are offered in slimmed-down versions:
id: Tipe status (playing, listening, streaming, watching) dapat diatur dengan enum :class:`ActivityType`. Untuk optimisasi memori, beberapa aktivitas dibuat versi simpelnya:

source: Putting both of these pieces of info together, you get the following: ::
id: Menggunakan keduanya bersama, anda akan melihat hal seperti ini: ::

source: How do I send a message to a specific channel?
id: Bagaimana saya mengirim pesan ke kanal tertentu?

source: You must fetch the channel directly and then call the appropriate method. Example: ::
id: Anda harus mengambil kanalnya terlebih dahulu dengan metode yang benar. Contoh: ::

source: How do I send a DM?
id: Bagaimana saya mengirim DM?

source: Get the :class:`User` or :class:`Member` object and call :meth:`abc.Messageable.send`. For example: ::
id: Gunakan obyek :class:`User` atau :class:`Member` dan panggil :meth:`abc.Messageable.send`. Contohnya: ::

source: If you are responding to an event, such as :func:`on_message`, you already have the :class:`User` object via :attr:`Message.author`: ::
id: Jika anda merespon sebuah event, seperti :func:`on_message`, anda harusnya mendapatkan obyek :class:`User` melalui :attr:`Message.author`: ::

source: How do I get the ID of a sent message?
id: Bagaimana saya mendapatkan ID pesan?

source: :meth:`abc.Messageable.send` returns the :class:`Message` that was sent. The ID of a message can be accessed via :attr:`Message.id`: ::
id: :meth:`abc.Messageable.send` memberikan obyek :class:`Message` saat pesan terkirim. ID pesan dapat diakses dengan :attr:`Message.id`: ::

source: How do I upload an image?
id: Bagaimana saya mengunggah gambar?

source: To upload something to Discord you have to use the :class:`File` object.
id: Untuk mengunggah sesuatu ke Discord, anda harus menggunakan obyek :class:`File`.

source: A :class:`File` accepts two parameters, the file-like object (or file path) and the filename to pass to Discord when uploading.
id: Obyek :class:`File` menerima 2 parameter, obyek file-like (atau path file) dan nama file untuk diberikan ke Discord saat diunggah.

source: If you want to upload an image it's as simple as: ::
id: Jika anda ingin mengunggah gambar, contohnya seperti ini: ::

source: If you have a file-like object you can do as follows: ::
id: Jika anda mempunyai obyek file-like, anda dapat mengikuti ini: ::

source: To upload multiple files, you can use the ``files`` keyword argument instead of ``file``\: ::
id: Untuk mengunggah file lebih dari satu, anda dapat menggunakan parameter ``files`` daripada ``file``: ::

source: If you want to upload something from a URL, you will have to use an HTTP request using :doc:`aiohttp <aio:index>` and then pass an :class:`io.BytesIO` instance to :class:`File` like so:
id: Jika anda ingin mengunggah sesuatu dari URL, anda harus menggunakan HTTP request dengan modul :doc:`aiohttp <aio:index>` dan berikan obyek :class:`io.BytesIO` ke obyek :class:`File` seperti:

source: How can I add a reaction to a message?
id: Bagaimana saya menambah reaksi ke sebuah pesan?

source: You use the :meth:`Message.add_reaction` method.
id: Anda dapat menggunakan metode :meth:`Message.add_reaction`.

source: If you want to use unicode emoji, you must pass a valid unicode code point in a string. In your code, you can write this in a few different ways:
id: Jika anda ingin menggunakan emoji, anda harus memberikan emoji code point sebagai string. Anda dapat menulis kodenya dengan berbagai cara:

source: Quick example: ::
id: Contoh: ::

source: In case you want to use emoji that come from a message, you already get their code points in the content without needing to do anything special. You **cannot** send ``':thumbsup:'`` style shorthands.
id: Jika anda ingin menggunakan emoji dari pesan, anda sudah mendapatkan code point di bagian konten tanpa harus melakukan hal macam-macam. Anda **tidak dapat** menggunakan ``:thumbsup:``.

source: For custom emoji, you should pass an instance of :class:`Emoji`. You can also pass a ``'<:name:id>'`` string, but if you can use said emoji, you should be able to use :meth:`Client.get_emoji` to get an emoji via ID or use :func:`utils.find`/ :func:`utils.get` on :attr:`Client.emojis` or :attr:`Guild.emojis` collections.
id: Untuk emoji kustom, anda harus menggunakan obyek :class:`Emoji`. Anda juga dapat menggunakan string ``<:name:id>``, tapi jika anda dapat mengapatkan emoji yang diinginkan, anda harusnya dapat menggunakan :meth:`Client.get_emoji` untuk mendapatkan emoji melalui ID atau gunakan metode :func:`utils.find`/ :func:`utils.get` pada :attr:`Client.emojis` atau :attr:`Guild.emojis`.

source: The name and ID of a custom emoji can be found with the client by prefixing ``:custom_emoji:`` with a backslash. For example, sending the message ``\:python3:`` with the client will result in ``<:python3:232720527448342530>``.
id: Nama dan ID emoji kustom dapat ditemukan di klien Discord dengan menambah backslash ke teks ``:custom_emoji:``. Contohnya, mengirim pesan ``\:python3:`` akan mengubahnya menjadi ``<:python3:232720527448342530>``.

source: How do I pass a coroutine to the player's "after" function?
id: Bagaimana saya memberikan coroutine setelah fungsi "after"?

source: The library's music player launches on a separate thread, ergo it does not execute inside a coroutine. This does not mean that it is not possible to call a coroutine in the ``after`` parameter. To do so you must pass a callable that wraps up a couple of aspects.
id: Modul penyetel musik jalan di thread lain, modulnya tidak jalan di dalam coroutine. Ini bukan berarti tidak mungkin untuk memberikan coroutine ke parameter ``after``. Untuk melakukan hal tersebut anda harus memberikan sebuah fungsi dan "membungkusnya" dengan beberapa aspek.

source: The first gotcha that you must be aware of is that calling a coroutine is not a thread-safe operation. Since we are technically in another thread, we must take caution in calling thread-safe operations so things do not bug out. Luckily for us, :mod:`asyncio` comes with a :func:`asyncio.run_coroutine_threadsafe` function that allows us to call a coroutine from another thread.
id: Hal pertama yang harus anda perhatikan adalah, coroutine tidak "thread-safe". Secara teknis modul voice berjalan di thread lain, jadi kita harus berhati-hati memanggil fungsi thread-safe agar tidak terjadi kesalahan. Untungnya, :mod:`asyncio` memiliki fungsi :func:`asyncio.run_coroutine_threadsafe` yang dapat kita gunakan untuk memanggil coroutine di thread lain.

source: However, this function returns a :class:`~concurrent.futures.Future` and to actually call it we have to fetch its result. Putting all of this together we can do the following: ::
id: Tetapi, fungsi ini mengembalikan obyek :class:`~concurrent.futures.Future` dan untuk memanggilnya kita harus mengambil hasilnya terlebih dahulu, Setelah menggabungkan semuanya menjadi satu, kita dapat melakukan ini: ::

source: How do I run something in the background?
id: Bagaimana saya menjalankan sesuatu di background?

source: `Check the background_task.py example. <https://github.com/naoTimesdev/ndiscord.py/blob/master/examples/background_task.py>`_
id: Coba periksa `contoh background_task.py <https://github.com/naoTimesdev/ndiscord.py/blob/master/examples/background_task.py>_

source: How do I get a specific model?
id: Bagaimana saya mengambil obyek tertentu?

source: There are multiple ways of doing this. If you have a specific model's ID then you can use one of the following functions:
id: Ada berbagai cara untuk melakukannya. Jika anda memiliki ID obyek tertentu, anda dapat menggunakan fungsi ini:

source: The following use an HTTP request:
id: Untuk yang ini menggunakan HTTP request:

source: If the functions above do not help you, then use of :func:`utils.find` or :func:`utils.get` would serve some use in finding specific models.
id: Jika fungsi diatas tidak dapat membantu, anda dapat mencoba fungsi :func:`utils.find` atau :func:`utils.get` yang mungkin dapat membantu mencari kelas tertentu.

source: How do I make a web request?
id: Bagaimana saya melakukan web request?

source: To make a request, you should use a non-blocking library. This library already uses and requires a 3rd party library for making requests, :doc:`aiohttp <aio:index>`.
id: Untuk melakukan request, disarankan menggunakan modul non-blocking. Modul ini sudah menggunakan modul 3rd-party untuk melakukan requests, :doc:`aiohttp <aio:index>`.

source: See `aiohttp's full documentation <http://aiohttp.readthedocs.io/en/stable/>`_ for more information.
id: Mohon kunjungi `dokumentasi penuh aiohttp <http://aiohttp.readthedocs.io/en/stable/>`_ untuk info lebih lanjut.

source: How do I use a local image file for an embed image?
id: Bagaimana saya menggunakan gambar lokal untuk dimasukan ke embed?

source: Discord special-cases uploading an image attachment and using it within an embed so that it will not display separately, but instead in the embed's thumbnail, image, footer or author icon.
id: Discord memiliki cara khusus untuk mengunggah gambar dan menggunkannya di dalam embed agar tidak ditampilkan terpisah, tetapi di dalam embed thumbnail, image, footer, atau author icon.

source: To do so, upload the image normally with :meth:`abc.Messageable.send`, and set the embed's image URL to ``attachment://image.png``, where ``image.png`` is the filename of the image you will send.
id: Untuk melakukannya, unggah gambar seperti biasa dengan :meth:`abc.Messageable.send`, dan atur URL gambar di embed ke ``attachment://image.png``, di mana ``image.png`` merupakan nama file yang anda kirim.

source: Due to a Discord limitation, filenames may not include underscores.
id: Dikarenakan limitasi Discord, nama file tidak dapat mengandung garis bawah.

source: Is there an event for audit log entries being created?
id: Apakah ada event untuk entri audit log baru?

source: Since Discord does not dispatch this information in the gateway, the library cannot provide this information. This is currently a Discord limitation.
id: Dikarenakan Discord tidak memberikan informasi ini lewat gateway mereka, modul ini tidak dapat memberikan informasi ini. Untuk sekarang ini adalah limitasi Discord.

source: Commands Extension
id: Ekstensi Perintah

source: Questions regarding ``discord.ext.commands`` belong here.
id: Pertanyaan tentang ``discord.ext.commands`` akan dijelaskan di sini.

source: Why does ``on_message`` make my commands stop working?
id: Kenapa ``on_message`` membuat semua perintah saya berhenti bekerja?

source: Overriding the default provided ``on_message`` forbids any extra commands from running. To fix this, add a ``bot.process_commands(message)`` line at the end of your ``on_message``. For example: ::
id: Melakukan override fungsi default ``on_message`` berarti membuat bot tidak dapat menjalankan perintah lain yang ada didalamnya. Untuk memperbaiki ini, mohon tambahkan ``bot.process_commands(message)`` diakhir fungsi ``on_message`` anda. Sebagai contoh: ::

source: Alternatively, you can place your ``on_message`` logic into a **listener**. In this setup, you should not manually call ``bot.process_commands()``. This also allows you to do multiple things asynchronously in response to a message. Example::
id: Cara lainnya, anda dapat menaruh ``on_message`` menjadi **listener**. Jika anda melakukan ini, anda tidak perlu memanggil fungsi ``bot.process_commands()``. Ini juga memungkinkan anda untuk melakukan berbagai hal dengan asynchronously untuk menjawab semua pesan. Contoh::

source: Why do my arguments require quotes?
id: Kenapa argument saya membutuhkan kutip?

source: In a simple command defined as: ::
id: Sebuah perintah simpel yang didefinisasikan seperti ini: ::

source: Calling it via ``?echo a b c`` will only fetch the first argument and disregard the rest. To fix this you should either call it via ``?echo "a b c"`` or change the signature to have "consume rest" behaviour. Example: ::
id: Memanggilnya dengan cara ``?echo a b c`` hanya akan memakai argumen pertama dan membuang argumen lainnya. Untuk memperbaikinya anda harus memanggilnya dengan cara ``?echo "a b c"`` atau mengganti signature perintah untuk *memproses* hal lainnya. Contoh: ::

source: This will allow you to use ``?echo a b c`` without needing the quotes.
id: Ini akan membuat anda dapat menggunakan ``?echo a b c`` tanpa membutuhkan kutip.

source: How do I get the original ``message``\?
id: Bagaimana saya mendapatkan ``pesan`` asli?

source: The :class:`~ext.commands.Context` contains an attribute, :attr:`~.Context.message` to get the original message.
id: Kelas :class:`~ext.commands.Context` terdapat attribut, :attr:`~.Context.message` untuk mengambil pesan asli.

source: Example: ::
id: Contoh: ::

source: How do I make a subcommand?
id: Bagaimana saya membuat subperintah?

source: Use the :func:`~ext.commands.group` decorator. This will transform the callback into a :class:`~ext.commands.Group` which will allow you to add commands into the group operating as "subcommands". These groups can be arbitrarily nested as well.
id: Gunakan decorator :func:`~ext.commands.group`. Ini akan mengubah fungsi callback menjadi :class:`~ext.commands.Group` yang akan membuat anda bisa menambah perintah ke sebuah grup, membuatnya sebagai "subcommands".

source: This could then be used as ``?git push origin master``.
id: Ini dapat digunakan seperti ``?git push origin master``.
