Repository: naoTimesdev/ndiscord.py
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: id

source: discord.ext.commands API Reference
id: Referensi API discord.ext.commands

source: discord.ext.tasks API Reference
id: Referensi API discord.ext.tasks

source: discord.ext.app API Reference
id: Referensi API discord.ext.app

source: Welcome to ndiscord.py
id: Selamat datang di ndiscord.py

source: ndiscord.py is a modern, easy to use, feature-rich, and async ready API wrapper for Discord.
id: ndiscord.py adalah API wrapper modern, mudah dipakai, banyak fitur, dan async-ready untuk Discord API.

source: **Features:**
id: **Fitur:**

source: Modern Pythonic API using ``async``\/``await`` syntax
id: API Python modern dengan sintaks ``async``\/``await``

source: Sane rate limit handling that prevents 429s
id: Rate limit yang membantu mengurus error 429

source: Command extension to aid with bot creation
id: Ekstensi perintah untuk membantu pembuatan Bot

source: Easy to use with an object oriented design
id: Desain object oriented yang mudah dipakai

source: Optimised for both speed and memory
id: Dioptimisasi agar cepat dan hemat memori

source: Getting started
id: Memulai

source: Is this your first time using the library? This is the place to get started!
id: Apakah ini pertama kalinya anda menggunkan modul ini? Inilah tempat di mana anda bisa memulai!

source: **First steps:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`
id: **Langkah pertama:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`

source: **Working with Discord:** :doc:`discord` | :doc:`intents`
id: **Bekerja dengan Discord:** :doc:`discord` | :doc:`intents`

source: **Examples:** Many examples are available in the :resource:`repository <examples>`.
id: **Contoh:** Berbagai macam contoh di :resource:`repository <examples>`.

source: Getting help
id: Mendapatkan bantuan

source: If you're having trouble with something, these resources might help.
id: Jika anda mengalami masalah, mungkin ini dapat membantu anda.

source: Try the :doc:`faq` first, it's got answers to all common questions.
id: Mohon kunjungi laman :doc:`faq` terlebih dahulu, terdapat berbagai macam tanya-jawab yang mungkin dapat membantu.

source: If you're looking for something specific, try the :ref:`index <genindex>` or :ref:`searching <search>`.
id: Jika anda ingin yang lebih spesifik, coba gunakan :ref:`index <genindex>` atau :ref:`pencarian <search>`.

source: Report bugs in the :resource:`issue tracker <issues>`.
id: Lapor masalah di :resource:`GitHub <issues>`.

source: Ask in our :resource:`GitHub discussions page <discussions>`.
id: Tanyakan kami di :resource:`laman diskusi GitHub <discussions>`.

source: Extensions
id: Ekstensi

source: These extensions help you during development when it comes to common tasks.
id: Ekstensi ini dapat membantu anda untuk melakukan berbagai macam hal.

source: Manuals
id: Manual

source: These pages go into great detail about everything the API can do.
id: Halaman ini menjelaskan berbagai macam hal yang API bisa lakukan.

source: If you're looking for something related to the project itself, it's here.
id: Jika anda mencari hal yang berhubungan tentang proyek ini sendiri, ada di sini.
