Repository: naoTimesdev/ndiscord.py
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: id

source: Introduction
id: Pengantar

source: This is the documentation for ndiscord.py, a library for Python to aid in creating applications that utilise the Discord API.
id: Ini merupakan dokumentasi untuk ndiscord.py, sebuah modul Python untuk membantu aplikasi yang ingin berkomunikasi dengan API Discord.

source: Prerequisites
id: Prasyarat

source: ndiscord.py works with Python 3.8 or higher. Support for earlier versions of Python is not provided. Python 2.7 or lower is not supported. Python 3.7 or lower is not supported.
id: ndiscord.py dapat digunakan dengan Python 3.8 keatas. Dukungan untuk versi lebih awal tidak diberikan. Python 2.7 atau lebih awal tidak didukung. Python 3.7 atau lebih awal juga tidak didukung.

source: Installing
id: Memasang

source: You can only install this library by using development version: ::
id: Anda hanya dapat memasang versi development untuk modul ini: ::

source: or clone it manually: ::
id: atau meng-klon secara manual: ::

source: To get voice support, you should use ``discord.py[voice]`` instead of ``discord.py``, e.g. ::
id: Untuk mendapatkan fitur voice, anda harus menambah ``[voice]`` diakhir requirement, contoh: ::

source: On Linux environments, installing voice requires getting the following dependencies:
id: Di linux, untuk menambah fitur suara anda harus menambah dependencies berikut:

source: For a Debian-based system, the following command will get these dependencies:
id: Untuk sistem Debian-based, anda dapat menggunakan perintah berikut:

source: Remember to check your permissions!
id: Jangan lupa untuk memeriksa permission anda!

source: Sometimes you want to keep libraries from polluting system installs or use a different version of libraries than the ones installed on the system. You might also not have permissions to install libraries system-wide. For this purpose, the standard library as of Python 3.3 comes with a concept called "Virtual Environment"s to help maintain these separate versions.
id: Terkadang anda tidak ingin modul memenuhi instalasi sistem atau menggunakan berbagai versi di satu sistem. Anda mungkin juga tidak ada hak untuk melakukan instalasi pada sistem. Maka, mulai dari Python 3.3 terdapat konsep bernama "Virtual Environment"s untuk membantu instalasi berbagai macam versi pada satu sistem.

source: A more in-depth tutorial is found on :doc:`py:tutorial/venv`.
id: Tutorial lebih lanjut dapat anda liat pada :doc:`py:tutorial/venv`.

source: However, for the quick and dirty:
id: Tetapi, singkatnya adalah:

source: Go to your project's working directory:
id: Buka folder proyek anda:

source: Activate the virtual environment:
id: Aktifkan virtual environment:

source: On Windows you activate it with:
id: Di Windows, anda dapat melakukannya dengan:

source: Use pip like usual:
id: Lalu gunakan pip seperti biasa:

source: Congratulations. You now have a virtual environment all set up.
id: Selamat. Anda sekarang memiliki virtual environment yang siap dipakai.

source: Basic Concepts
id: Konsep Dasar

source: ndiscord.py revolves around the concept of :ref:`events <discord-api-events>`. An event is something you listen to and then respond to. For example, when a message happens, you will receive an event about it that you can respond to.
id: ndiscord.py berkisar pada konsep :ref:`events <discord-api-events>`. Sebuah event adalah sesuatu yang harus anda tangkap dan respon. Contohnya, ketika ada pesan baru, anda akan mendapatkan event tersebut dan anda dapat meresponnya.

source: A quick example to showcase how events work:
id: Contoh untuk memperlihatkan bagaimana event bekerja:
