Repository: naoTimesdev/ndiscord.py
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: id

source: Quickstart
id: Memulai

source: This page gives a brief introduction to the library. It assumes you have the library installed, if you don't check the :ref:`installing` portion.
id: Laman ini memberikan sedikit introduksi untuk modul ini. Kami akan mengasumsikan kalau anda sudah menginstall modul, jika belum mohon kunjungi bagian :ref:`installing`.

source: A Minimal Bot
id: Bot minimalis

source: Let's make a bot that responds to a specific message and walk you through it.
id: Mari kita buat bot yang akan merespon pesan spesifik.

source: It looks something like this:
id: Kurang lebih akan terlihat seperti ini:

source: Let's name this file ``example_bot.py``. Make sure not to name it ``ndiscord.py`` as that'll conflict with the library.
id: Mari kita namakan filenya menjadi ``example_bot.py``. Pastikan namanya bukan ``ndiscord.py`` karena akan konflik dengan nama modul ini.

source: There's a lot going on here, so let's walk you through it step by step.
id: Melihat sekilas, banyak sekali hal yang kita akan jelaskan satu-per-satu.

source: The first line just imports the library, if this raises a `ModuleNotFoundError` or `ImportError` then head on over to :ref:`installing` section to properly install.
id: Baris pertama yaitu import modul, jika terjadi error `ModuleNotFoundError` atau `ImportError` disarankan anda mengunjungi bagian :ref:`installing` untuk melakukan instalasi dengan benar.

source: Next, we create an instance of a :class:`Client`. This client is our connection to Discord.
id: Lalu, kita buat instansi :class:`Client`. Klien ini akan menjadi jembatan koneksi kita ke Discord.

source: We then use the :meth:`Client.event` decorator to register an event. This library has many events. Since this library is asynchronous, we do things in a "callback" style manner.
id: Lalu kita menggunakan dekorator :meth:`Client.event` untuk mendaftarkan event. Modul ini memiliki banyak sekali event. Dikarenakan modul ini bersifat asynchronous, maka kita melakukan berbagai hal dengan sistem "callback".

source: A callback is essentially a function that is called when something happens. In our case, the :func:`on_ready` event is called when the bot has finished logging in and setting things up and the :func:`on_message` event is called when the bot has received a message.
id: Callback simpelnya adalah fungsi yang dipanggil jika sesuatu terjadi. Dicontoh ini, event :func:`on_ready` dipanggil jika bot selesai masuk dan terhubung ke Discord dan event :func:`on_message` dipanggil jika bot mendapatkan pesan.

source: Since the :func:`on_message` event triggers for *every* message received, we have to make sure that we ignore messages from ourselves. We do this by checking if the :attr:`Message.author` is the same as the :attr:`Client.user`.
id: Dikarenakan :func:`on_message` dipanggil *tiap* bot menerima pesan, maka kita harus mengabaikan pesan yang dikirim oleh bot kita sendiri. Kita dapat melakukannya dengan memeriksa apakah :attr:`Message.author` sama dengan :attr:`Client.user`.

source: Afterwards, we check if the :class:`Message.content` starts with ``'$hello'``. If it does, then we send a message in the channel it was used in with ``'Hello!'``. This is a basic way of handling commands, which can be later automated with the :doc:`./ext/commands/index` framework.
id: Lalu, kita bisa memeriksa apabila :class:`Message.content` mulai dengan ``$hello``. Jika iya, kita akan mengirim ke kanal di mana perintah itu digunakan dengan ``Hello!``. Ini adalah cara simpel memproses perintah, yang kita dapat buat lebih mudah dengan kerangka :doc:`./ext/commands/index`.

source: Finally, we run the bot with our login token. If you need help getting your token or creating a bot, look in the :ref:`discord-intro` section.
id: Akhirnya, kita dapat menjalankan bot dengan token kita. Jika kalian butuh bantuan mendapatkan token atau membuat akun bot, mohon lihat :ref:`discord-intro`.

source: Now that we've made a bot, we have to *run* the bot. Luckily, this is simple since this is just a Python script, we can run it directly.
id: Sekarang kita sudah beres membuat basis botnya, kita harus *jalankan* botnya. Untungnya, karena ini hanyalah skrip Python biasanya, kita bisa langsung jalankan.

source: On Windows:
id: Windows:

source: On other systems:
id: Sistem lain:

source: Now you can try playing around with your basic bot.
id: Sekarang anda dapat mengutak-atik bot simpel anda.
