Repository: naoTimesdev/ndiscord.py
Catalog: docs/locale/*/LC_MESSAGES/version_guarantees.po
Languages: id

source: Version Guarantees
id: Jaminan Versi

source: The library follows a `semantic versioning principle <https://semver.org/>`_ which means that the major version is updated every time there is an incompatible API change. However due to the lack of guarantees on the Discord side when it comes to breaking changes along with the fairly dynamic nature of Python it can be hard to discern what can be considered a breaking change and what isn't.
id: Modul ini mengikuti `prinsipalitas semantic versioning <https://semver.org/>`_ yang berarti versi major akan diubah setiap ada perubahan yang tidak cocok dengan versi lama. Tapi dikarenakan Discord tidak memberikan jaminan ketika ada perubahan mendadak dan juga Python sendiri yang ribet untuk diurus. Akan susah menentukan mana yang perubahan major dan yang tidak.

source: The first thing to keep in mind is that breaking changes only apply to **publicly documented functions and classes**. If it's not listed in the documentation here then it is not part of the public API and is thus bound to change. This includes attributes that start with an underscore or functions without an underscore that are not documented.
id: Hal yang harus diketahui, perubahan major hanyalah berlaku untuk **fungsi dan kelas yang didokumentasikan**. Jika tidak ada di dokumentasi maka fungsi atau kelas tersebut bukanlah bagian dari API publik dan dapat berubah sewaktu-waktu. Ini berlaku juga untuk attribut yang diawali dengan garis bawah atau fungsi tanpa garis bawah yang tidak didokumentasikan.

source: The examples below are non-exhaustive.
id: Contoh berikut tidak mencakup sepenuhnya.

source: Examples of Breaking Changes
id: Contoh perubahan major

source: Changing the default parameter value to something else.
id: Mengubah parameter default menjadi yang lain.

source: Renaming a function without an alias to an old function.
id: Mengubah nama fungsi tanpa membuat alias nama fungsi lama.

source: Adding or removing parameters to an event.
id: Menambah atau menghapus parameter ke sebuah event.

source: Examples of Non-Breaking Changes
id: Contoh perubahan non-major

source: Adding or removing private underscored attributes.
id: Menambah atau menghapus attribute awalan garis bawah.

source: Adding an element into the ``__slots__`` of a data class.
id: Menambah elemen ke data ``__slots__`` pada sebuah kelas.

source: Changing the behaviour of a function to fix a bug.
id: Mengubah sesuatu untuk memperbaiki bug atau error.

source: Changes in the documentation.
id: Perubahan pada dokumentasi.

source: Modifying the internal HTTP handling.
id: Mengubah penangan internal HTTP.

source: Upgrading the dependencies to a new version, major or otherwise.
id: Mengubah versi depedencies, maupun yang major atau tidak.
